tests/integration/PaymentGatewayApi/fixtures/checkPaymentResponse.json

{
  "reference_no": null,
  "inserted": "2022-11-10 08:43:33",
  "invoice_amount": "222.00",
  "type": "Sell",
  "invoice_currency": "EUR",
  "amount": "0.01333323",
  "min_confirmations": "1",
  "accept_zero_confirmations": "1",
  "require_kyt_for_confirmation": "0",
  "currency": "BTC",
  "confirmed": false,
  "confirmed_time": null,
  "reason": null,
  "payment": "0.0000000",
  "sid": null,
  "confirmations": "0",
  "access_token": "fz7RCsx3Vl5VwijzFfVy1TssSiD8V9f2c7CAjKEKPzO7YvjfTHXFI5TT5lg22tDa",
  "access_url": "https:\/\/example-pgw.forumpay.com\/pay?merchant_id=6a69b8ca-dc98-47d4-a33d-5edefee17f22&order_amount=222.00&order_currency=EUR&item_name=#checkPayment$web$3547ade6-cab8-4ce8-9ec9-c4fd7286363c$BTC$btc-32d7e90b1ff241ab81a36e22696c0047$6a69b8ca-dc98-47d4-a33d-5edefee17f22$fz7RCsx3Vl5VwijzFfVy1TssSiD8V9f2c7CAjKEKPzO7YvjfTHXFI5TT5lg22tDa",
  "wait_time": null,
  "status": "Cancelled",
  "unconfirmed_amount": "0.0004361",
  "unconfirmed_invoice_amount": "11.73",
  "underpayment": {
    "address": "btc-32d7e90b1ff241ab81a36e22696c0047",
    "missing_amount": "0.01333323",
    "qr": "https://example-pgw.forumpay.com/sandboxWallet.transfer?currency=BTC&address=btc-7382eb0b31a74b91bf1ebb099624f237&amount=0.0000100",
    "qr_alt": "https://example-pgw.forumpay.com/sandboxWallet.transfer?currency=BTC&address=btc-7382eb0b31a74b91bf1ebb099624f237",
    "qr_img": "https://example-api.forumpay.com/qr/?d=https%3A%2F%2Fexample-pgw.forumpay.com%2FsandboxWallet.transfer%3Fcurrency%3DBTC%26address%3Dbtc-7382eb0b31a74b91bf1ebb099624f237%26amount%3D0.0000100",
    "qr_alt_img": "https://example-api.forumpay.com/qr/?d=https%3A%2F%2Fexample-pgw.forumpay.com%2FsandboxWallet.transfer%3Fcurrency%3DBTC%26address%3Dbtc-7382eb0b31a74b91bf1ebb099624f237"
  },
  "cancelled": true,
  "cancelled_time": "2022-11-10 08:48:48",
  "print_string": "<BR>Reference: web:3547ade6-cab8-4ce8-9ec9-c4fd7286363c<BR><DLINE><BR><CENTER>=== Cancelled ===<\/CENTER><BR><DLINE><BR><BR><CUT><LINE><BR>",
  "state": "cancelled"
}
